# 缓存的模板匹配图像,避免每次都要进行读取和转换
template_mat_map = {}

# 模板
模板_桌面_创建队伍 = '桌面_创建队伍'

模板_菜单_个人主页 = '菜单_个人主页'

模板_副本通用_日常玩法_主页 = '日常玩法_主页'
模板_副本通用_入场 = '副本_入场'
模板_副本通用_入场_已完成 = '副本_入场_已完成'
模板_副本通用_确定 = '副本_确定'
模板_副本通用_离开 = '副本_离开'
模板_副本通用_放弃 = '副本_放弃'
模板_副本通用_快速组队 = '副本_快速组队'
模板_副本通用_快速组队_已完成 = '副本_快速组队_已完成'

模板_材料副本_入口 = '材料副本_入口'
模板_材料副本_主页 = '材料副本_主页'
模板_精英副本_入口 = '精英副本_入口'
模板_精英副本_主页 = '精英副本_主页'

# 坐标
坐标_菜单 = (1220, 23, 30, 30)
坐标_菜单_日常玩法 = (1088, 260, 75, 75)

坐标_材料副本_入口 = (0, 142, 100, 100)
坐标_精英副本_入口 = (0, 142, 100, 100)
